Австралия/src/InformationRegisters/Barcodes/Barcodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Barcodes</name>
  <resources>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </resources>
  <resources>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </resources>
  <resources>
    <name>Batch</name>
    <type>
      <types>CatalogRef.ProductsBatches</types>
    </type>
  </resources>
  <resources>
    <name>MeasurementUnit</name>
    <type>
      <types>CatalogRef.UOM</types>
    </type>
  </resources>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <dimensions>
    <name>Barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/ProductsTypes/ProductsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProductsTypes</name>
  <enumValues>
    <name>InventoryItem</name>
  </enumValues>
  <enumValues>
    <name>Service</name>
  </enumValues>
  <enumValues>
    <name>Work</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/InformationRegisters/Barcodes/Forms/ListForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("Products") Then
		DriveClientServer.SetListFilterItem(List, "Products", Parameters.Products);
		If Parameters.Products.ProductsType <> Enums.ProductsTypes.InventoryItem Then
			AutoTitle = False;
			Title = NStr("en = 'Barcodes are stored only for inventories'; ru = 'Штрихкоды хранятся только для запасов';pl = 'Kody kreskowe są przechowywane tylko dla zapasów';es_ES = 'Códigos de barras se almacenan solo para inventarios';es_CO = 'Códigos de barras se almacenan solo para inventarios';tr = 'Barkodları sadece stoklar için saklanır';it = 'I codici a barre sono archiviati sono per scorte';de = 'Barcodes werden nur für Inventare gespeichert'");
			Items.List.ReadOnly = True;
		EndIf;
	EndIf;
	
	NewConditionalAppearance = List.ConditionalAppearance.Items.Add();
	WorkWithForm.AddFilterItem(NewConditionalAppearance.Filter, "MeasurementUnit", , "NotFilled");
	WorkWithForm.AddAppearanceField(NewConditionalAppearance, "MeasurementUnit");
	WorkWithForm.AddConditionalAppearanceItem(NewConditionalAppearance, "Text", New DataCompositionField("Products.MeasurementUnit"));
	
EndProcedure
